snlkuharlocal/src/Catalogs/ФР_ПакетыДанных/ФР_ПакетыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФР_ПакетыДанных</name>
  <attributes>
    <name>ДанныеПакета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибкиПакета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Пакета</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Сеанса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <comment>Загрузка-Выгрузка</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбъектовВПакете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОшибокЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяФормирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПакет</name>
    <type>
      <types>CatalogRef.ФР_ПакетыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфо</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПорядка</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиПакета</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыПакета</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ОперВыгрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/InformationRegisters/СостояниеПакетовОбмена/СостояниеПакетовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеПакетовОбмена</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИД_ЗаданияЗагрузкиДанных</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ПакетаЗаданийЗагрузки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибкиЗагрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРедактированияЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пакет</name>
    <type>
      <types>CatalogRef.ФР_ПакетыДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодУзла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Catalogs/ФР_ПакетыДанных/ManagerModule.bsl
#Область СобытияМенеджера


Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


#КонецОбласти 

Функция ВыгрузитьПакет(ПакетСсылка)	Экспорт
	Результат 	= МаркировкаКС.СтруктураРезультата();
	
	Начало		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	СпрОбъект	= ПакетСсылка.ПолучитьОбъект();
	
	МетаОбъект	= Метаданные.Справочники.ФР_ПакетыДанных;
	
	ОбразПакета = Новый Структура;	
	Для Каждого МетаРекв Из МетаОбъект.СтандартныеРеквизиты Цикл		
		ОбразПакета.Вставить(МетаРекв.Имя, СпрОбъект[МетаРекв.Имя]);		
	КонецЦикла;	
	
	Для Каждого МетаРекв Из МетаОбъект.Реквизиты Цикл
		Если МетаРекв.Имя = "ДанныеПакета" Тогда
			ОбразПакета.Вставить(МетаРекв.Имя, XMLСтрока(СпрОбъект[МетаРекв.Имя]));
		Иначе			
			ОбразПакета.Вставить(МетаРекв.Имя, СпрОбъект[МетаРекв.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	ОбразПакета.Вставить("ОбъектыПакета",	СпрОбъект.ОбъектыПакета.Выгрузить());
	ОбразПакета.Вставить("ИД_Пакета", 		ПакетСсылка.УникальныйИдентификатор());
	
	Результат.Данные = ПолучитьДвоичныеДанныеИзСтроки(ОбменДаннымиЧЗ.СериализоватьВJSON(ОбразПакета));	
	
	Результат.Вставить("Отправитель", 		СпрОбъект.Отправитель);
	Результат.Вставить("Получатель",		СпрОбъект.Получатель);
	Результат.Вставить("НомерСообщения",	СпрОбъект.НомерСообщения);
	
	ТекстСообщения = СтрШаблон("Время выгрузки: %1 сек., размер данных: %2 байт.", (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000, Формат(Результат.Данные.Размер(), "ЧРГ=' '; ЧГ=3,0"));
	Результат.Сообщения.Добавить(ТекстСообщения);
	
	Возврат Результат;	
КонецФункции

Функция ИмяФайлаВыгрузки(Пакет) Экспорт
	рВыгрузки = ПолучитьРеквизитыШапки(Пакет, "Отправитель,Получатель,НомерСообщения");
	Возврат СтрШаблон("Msg_%1_%2_%3.dd", СокрЛП(рВыгрузки.Отправитель), СокрЛП(рВыгрузки.Получатель), рВыгрузки.НомерСообщения);
КонецФункции //ИмяФайлаВыгрузки(Пакет) Экспорт

Функция ПрочитатьПакет(ДД, фПерезаписывать = Ложь) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();	
	
	Данные = ОбменДаннымиЧЗ.ПрочитатьИзJSON(ПолучитьСтрокуИзДвоичныхДанных(ДД));
	
	ПакетСсылка = Справочники.ФР_ПакетыДанных.ПолучитьСсылку(Данные.ИД_Пакета);
	
	Если НЕ МаркировкаС.ОбъектСуществует(ПакетСсылка) Тогда
		СпрОбъект = Справочники.ФР_ПакетыДанных.СоздатьЭлемент();		
		СпрОбъект.УстановитьСсылкуНового(ПакетСсылка);
	Иначе		
		Если фПерезаписывать Тогда		
			СпрОбъект = ПакетСсылка.ПолучитьОбъект();
		Иначе
			Результат.Успешно = Ложь;
			Результат.Ошибки.Добавить(СтрШаблон("Пакет: '%1' уже существует !", ПакетСсылка));
			
			Возврат Результат;
		КонецЕсли;		
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(СпрОбъект, Данные, , "ДанныеПакета");			
	СпрОбъект.ДанныеПакета = XMLЗначение(Тип("ХранилищеЗначения"), Данные.ДанныеПакета);
	
	ОбъектыПакета = МаркировкаКС.ПолучитьЗначениеПараметра(Данные, "ОбъектыПакета");
	Если ТипЗнч(ОбъектыПакета) = Тип("ТаблицаЗначений") Тогда
		СпрОбъект.ОбъектыПакета.Загрузить(ОбъектыПакета);	
	КонецЕсли; 
	
	Попытка
		СпрОбъект.Записать();	
		ОбновитьСтатусПакета(СпрОбъект.Ссылка, Новый Структура("ДатаПолучения", ТекущаяДата())); 
	
		Результат.Данные = СпрОбъект.Ссылка;
		Результат.Сообщения.Добавить("Время записи: " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)+", размер пакета: " + ДД.Размер()+".");
	Исключение
		Результат.Ошибки.Добавить("Ошибка записи пакета: " + СпрОбъект + ". " + ОписаниеОшибки());		
		Результат.Успешно = Ложь;
	КонецПопытки;	
	
	Возврат Результат;
КонецФункции //ПрочитатьПакет(ДД, фПерезаписывать = Ложь)

Функция ЗагрузитьПакетыПоПорядку(Знач ДопПараметры = Неопределено, АдресВозврата = Неопределено) Экспорт
	Результат		= МаркировкаКС.СтруктураРезультата();
	ИмяПланаОбмена	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ИмяПланаОбмена", "ДанныеЧЗ");
	
	НаборыПакетов = ПакетыКЗагрузкеПоПорядку(ИмяПланаОбмена);	
	
	Для Каждого Пакеты Из НаборыПакетов Цикл		
	    рЗагрузки = ЗагрузитьПакеты(Пакеты, ДопПараметры, АдресВозврата);
		Если рЗагрузки.Успешно Тогда
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рЗагрузки);
		КонецЕсли;
	КонецЦикла;
	
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ЗагрузитьПакетыПоПорядку(Знач ДопПараметры = Неопределено, АдресВозврата = Неопределено) Экспорт
	
Функция ЗагрузитьПакеты(Пакеты_ = Неопределено, Знач ДопПараметры = Неопределено, АдресВозврата = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Соответствие;	
	КонецЕсли;
	
	ИмяПланаОбмена	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ИмяПланаОбмена", "ДанныеЧЗ");
	ИмяЛога			= ОбменДаннымиЧЗ.ИмяЛогаОбмена(ИмяПланаОбмена);
	
	Если ТипЗнч(Пакеты_) = Тип("Массив") Тогда
		Пакеты = Пакеты_;
	ИначеЕсли ЗначениеЗаполнено(Пакеты_) Тогда                
		Пакеты = Новый Массив;		
		Пакеты.Добавить(Пакеты_);
	Иначе
		Пакеты = ПакетыКЗагрузке(ИмяПланаОбмена);
	КонецЕсли;	
	
	ПакетыКЗагрузке = Новый Массив;
	Для Каждого Пакет Из Пакеты Цикл		
		Если НЕ ЗагрузкаПакетаВыполняется(Пакет)  Тогда
			ПакетыКЗагрузке.Добавить(Пакет);
		КонецЕсли;
	КонецЦикла;	
	
	пВыполнения 		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "пВыполнения", 		инт_ДлительныеОперации.ПараметрыВыполненияВФоне());			
	пВыполнения.НаименованиеФоновогоЗадания = "Загрузка пакетов данных";
	фВыполнятьВФоне		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "фВыполнятьвФоне", 	Ложь);
	КоличествоПотоков	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "КоличествоПотоков", 5);	
		
	Если фВыполнятьВФоне Тогда
		ЗаданияЗагрузки 	= Новый Массив;
		АдресаРезультатов   = Новый Соответствие;
		
		Пачки = ОбменДаннымиЧЗ.РаспределитьПоЧастям(Пакеты, КоличествоПотоков);
		Для Каждого Пачка Из Пачки Цикл			
			пПроцедуры = Новый Массив;
			пПроцедуры.Добавить(Пачка);
			пПроцедуры.Добавить(ДопПараметры);
			
			рЗапуска = инт_ДлительныеОперации.ВыполнитьВФоне("Справочники.ФР_ПакетыДанных.ЗагрузитьПакетыВФоне", пПроцедуры, пВыполнения);
			
			ФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(рЗапуска.ИдентификаторЗадания);
			АдресаРезультатов[ФЗ] = Новый Структура("Пачка,АдресРезультата", Пачка, рЗапуска.АдресРезультата);
			ЗаданияЗагрузки.Добавить(ФЗ);
			
			Для Каждого Пакет Из Пачка Цикл
				ОбновитьСтатусПакета(Пакет, Новый Структура("ИД_ЗаданияЗагрузкиДанных", рЗапуска.ИдентификаторЗадания));
			КонецЦикла;
		КонецЦикла;
		
		инт_ДлительныеОперации.ОжидатьЗавершенияЗаданий(ЗаданияЗагрузки);
		
		ОбработаноПакетов = 0;
		Для Каждого ФЗ Из ЗаданияЗагрузки Цикл			
			рПачки = АдресаРезультатов[ФЗ];
			Если ФЗ.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
				рВыполненияПачки = ПолучитьИзВременногоХранилища(рПачки.АдресРезультата);
				ДанныеПакетов = МаркировкаКС.ПолучитьЗначениеПараметра(рВыполненияПачки, "Данные", Новый Соответствие);
				ОбработаноПакетов = ОбработаноПакетов + ДанныеПакетов.Количество();				
			Иначе
				Если ФЗ.ИнформацияОбОшибке <> Неопределено Тогда
					ТекстСообщения = СтрШаблон("%1 (стр. %2) %3 %4",
						ФЗ.ИнформацияОбОшибке.ИмяМодуля, ФЗ.ИнформацияОбОшибке.ИмяМодуля, ФЗ.ИнформацияОбОшибке.НомерСтроки, ФЗ.ИнформацияОбОшибке.Описание);					
				Иначе
					ТекстСообщения = СтрШаблон("Состояние ФЗ загрузки пачки: '%1'.", ФЗ.Состояние);
				КонецЕсли; 
				
				ТекстСообщения = СтрШаблон("Ошибка выполнения задания загрузки пачки: %1. %2", 
					ФЗ.УникальныйИдентификатор, ТекстСообщения);		
					
				Результат.Ошибки.Добавить(ТекстСообщения);
				
				ЗаписатьВЛог(ИмяЛога, ТекстСообщения, "Ошибка");
			КонецЕсли;					
		КонецЦикла; 
		
		ТекстСообщения = СтрШаблон("Завершена загрузка пакетов. Загружено: %1 пакетов.", Формат(ОбработаноПакетов, "ЧРГ=' '; ЧН=; ЧГ=3,0"));
		Результат.Сообщения.Добавить(ТекстСообщения);
		ЗаписатьВЛог(ИмяЛога, ТекстСообщения, "Информация");
	Иначе                                                                                                    
		Для Каждого Пакет Из ПакетыКЗагрузке Цикл
			рЗагрузкиПакета = ЗагрузитьПакет(Пакет, ДопПараметры);
			
			МаркировкаКС.ДобавитьСообщения(Результат, рЗагрузкиПакета);
			МаркировкаКС.ДобавитьОшибки(Результат, рЗагрузкиПакета);
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата); 	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ЗагрузитьПакеты(Пакеты_, ДопПараметры = Неопределено, АдресВозврата = Неопределено) Экспорт

Процедура ОжидатьЗавершенияЗаданий(Задания)
	ЕстьАктивные = Истина;
	
	Пока ЕстьАктивные Цикл
		ЕстьАктивные = Ложь;
		
		рВыполнения = ФоновыеЗадания.ОжидатьЗавершенияВыполнения(Задания);
		Для Каждого ФЗ Из рВыполнения Цикл
			Если ФЗ.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				ЕстьАктивные = Истина;
				Прервать;
			КонецЕсли;			
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры //ОжидатьЗавершенияЗаданий(Задания) 

Функция ЗагрузитьПакетыВФоне(Пакеты, ДопПараметры = Неопределено, АдресВозврата = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Результат.Данные = Новый Соответствие;
	
	Для Каждого Пакет Из Пакеты Цикл		
		рЗагрузки = ЗагрузитьПакет(Пакет, ДопПараметры);
		Результат.Данные[Пакет] = рЗагрузки;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(АдресВозврата) И ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ЗагрузитьПакетыВФоне(Пакеты, ДопПараметры = Неопределено, АдресВозврата = Неопределено) Экспорт

Функция ЗагрузитьПакет(ПакетСсылка, ДопПараметры = Неопределено, АдресВозврата = Неопределено) Экспорт	
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
		
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ПакетОбъект = ПакетСсылка.ПолучитьОбъект();	
	Отправитель = Маркировка_ПИ.УзелПоКоду(ПакетОбъект.Отправитель, ПакетОбъект.ПланОбмена);	
	ПланОбмена 	= ПакетОбъект.ПланОбмена;
	
	ИмяЛога = ОбменДаннымиЧЗ.ИмяЛогаОбмена(ПланОбмена);
	
	КодТекущегоУзла = Маркировка_ПИ.ЭтотУзел_Код(ПланОбмена);	
	ЗаписьЗагрузки = РегистрыСведений.СостояниеПакетовОбмена.ПолучитьЗаписьЗагрузки(ПакетСсылка, КодТекущегоУзла);
	
	Попытка
		СтрокаДанных = ПакетОбъект.ДанныеПакета.Получить();
		ДанныеПакета = ОбменДаннымиЧЗ.ПрочитатьИзJSON(СтрокаДанных);
	Исключение
		ТекстСообщения = СтрШаблон("Ошибка чтения данных пакета '%1', правило: '%2', ошибка: '%3'.", ПакетСсылка, ПакетОбъект.ПравилоВыгрузки, ОписаниеОшибки());
		ЗаписатьВЛог(ИмяЛога, ТекстСообщения, "Ошибка", , , (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000);
		
		Результат.Ошибки.Добавить(ТекстСообщения);
		Результат.Успешно = Ложь;               
		
		Возврат Результат;
	КонецПопытки;
	
	ТекстСообщения = СтрШаблон("Время разбора: %1, размер пакета распакованый: %2.", (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000, СтрДлина(СтрокаДанных));
	Результат.Сообщения.Добавить(ТекстСообщения);	
	
	ИмяЛога = ОбменДаннымиЧЗ.ИмяЛогаОбмена(ПакетОбъект.ПланОбмена);
	
	рЗагрузки = ЗагрузитьДанныеПакета(ДанныеПакета, Отправитель, ДопПараметры);	
	Если рЗагрузки.Успешно Тогда
		ТекстСообщения = СтрШаблон("Загружен пакет '%1', прочитано объектов: %2.", ПакетСсылка, рЗагрузки.ОбработаноОбъектов);
		ЗаписатьВЛог(ИмяЛога, ТекстСообщения, "Информация", , , (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000);		
	КонецЕсли; 
	
	ЕстьОшибкиЗагрузки  = МаркировкаКС.ПолучитьЗначениеПараметра(рЗагрузки, "ОшибкиЗаписи", Ложь);
	ОшибкиЗаписи 		= МаркировкаКС.ПолучитьЗначениеПараметра(рЗагрузки, "ОшибкиЗаписи");
	Если ТипЗнч(ОшибкиЗаписи) = Тип("ТаблицаЗначений") И  ОшибкиЗаписи.Количество() > 0 Тогда		
		ПакетОбъект.ОшибкиПакета.Загрузить(ОшибкиЗаписи);
		ПакетОбъект.Записать();
	ИначеЕсли ПакетОбъект.ОшибкиПакета.Количество() > 0 Тогда
		ПакетОбъект.ОшибкиПакета.Очистить();
		ПакетОбъект.Записать();		
	КонецЕсли;
	
	МаркировкаКС.ДобавитьСообщения(Результат, рЗагрузки);
	
	Результат.Данные = рЗагрузки;
	
	ОбновитьСтатусПакета(ПакетСсылка, Новый Структура("ДатаЗагрузки,ЕстьОшибкиЗагрузки", ТекущаяДата(), ЕстьОшибкиЗагрузки));
	
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);
	КонецЕсли; 
		
	Возврат Результат;
КонецФункции //ЗагрузитьПакет(ПакетСсылка) Экспорт

Функция ЗагрузитьДанныеПакета(ДанныеПакета, Отправитель, ДопПараметры) Экспорт
	Результат 		= МаркировкаКС.СтруктураРезультата();
	ОперВыгрузки	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеПакета, "ОперВыгрузки");
	
	Если ЗначениеЗаполнено(Отправитель) И Отправитель.Метаданные().Имя = "Свертка" Тогда
		ПараметрыСеанса.СверткаБазы 				= Истина;
		ПараметрыСеанса.ОтключитьКонтрольДЗР		= Истина;
		ПараметрыСеанса.ОтключитьЖурнализациюЗаписи = Истина;
		
		ДопПараметры.Вставить("фПерезаписывать", Истина);
	КонецЕсли;
	
	Если ОперВыгрузки = "Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ" Тогда
		Результат = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ЗагрузитьДанныеПакета(ДанныеПакета, Отправитель, ДопПараметры);
	ИначеЕсли ОперВыгрузки = "Документ.МаркировкаТоваровИСМП" Тогда
		Результат = Документы.МаркировкаТоваровИСМП.ЗагрузитьДанныеПакета(ДанныеПакета, Отправитель, ДопПараметры);	
	ИначеЕсли ОперВыгрузки = "Справочник.ШтрихкодыУпаковокТоваров"  Тогда
		Результат = Справочники.ШтрихкодыУпаковокТоваров.ЗагрузитьДанныеПакета(ДанныеПакета, Отправитель, ДопПараметры);
	ИначеЕсли ОперВыгрузки = "РегистрСведений.СостояниеПакетовОбмена"  Тогда		
		Результат = РегистрыСведений.СостояниеПакетовОбмена.ЗагрузитьДанные_Регистра(ДанныеПакета, Отправитель, ДопПараметры);
	ИначеЕсли СтрНачинаетсяС(ОперВыгрузки, "Документ.") Тогда
		МетаОбъект = Метаданные.НайтиПоПолномуИмени(ОперВыгрузки);
		
		Результат = ОбменДаннымиЧЗ.ЗагрузитьДанные_Документ(МетаОбъект.ПолноеИмя(), ДанныеПакета, Отправитель, ДопПараметры);
	ИначеЕсли СтрНачинаетсяС(ОперВыгрузки, "РегистрСведений.") Тогда
		МетаОбъект = Метаданные.НайтиПоПолномуИмени(ОперВыгрузки);
		
		Результат = ОбменДаннымиЧЗ.ЗагрузитьДанные_Регистра(МетаОбъект.ПолноеИмя(), ДанныеПакета, Отправитель, ДопПараметры);
	ИначеЕсли СтрНачинаетсяС(ОперВыгрузки, "Справочник.") Тогда
		МетаОбъект = Метаданные.НайтиПоПолномуИмени(ОперВыгрузки);
		
		Результат = ОбменДаннымиЧЗ.ЗагрузитьДанные_Справочник(МетаОбъект.ПолноеИмя(), ДанныеПакета, Отправитель, ДопПараметры);
	КонецЕсли;
	
	ПараметрыСеанса.СверткаБазы = Ложь;
	
	Возврат Результат;
КонецФункции //ЗагрузитьДанныеПакета(ДанныеПакета, Отправитель)

Функция ЗагрузкаПакетаВыполняется(Пакет)
	Результат		= Ложь;
	
	ПланОбмена		= ПолучитьРеквизитШапки(Пакет, "ПланОбмена");
    КодТекущегоУзла = Маркировка_ПИ.ЭтотУзел_Код(ПланОбмена);
	
    ЗаписьЗагрузки = РегистрыСведений.СостояниеПакетовОбмена.ПолучитьЗаписьЗагрузки(Пакет, КодТекущегоУзла);	
	
	Если ЗначениеЗаполнено(ЗаписьЗагрузки.ИД_ЗаданияЗагрузкиДанных) Тогда
		ФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ЗаписьЗагрузки.ИД_ЗаданияЗагрузкиДанных);
		Если ФЗ<>Неопределено Тогда
			Если ФЗ.Состояние = СостояниеФоновогоЗадания.Активно Тогда			
				Результат = Истина;
			Иначе
				МЗ = РегистрыСведений.СостояниеПакетовОбмена.СоздатьМенеджерЗаписи();
				
				ЗаполнитьЗначенияСвойств(МЗ, ЗаписьЗагрузки);
				
				МЗ.Пакет 	= Пакет;
				МЗ.КодУзла	= КодТекущегоУзла;			
				
				МЗ.Удалить();
			КонецЕсли; 			
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ЗагрузкаПакетаВыполняется(Пакет)

Функция ОбновитьСтатусПакета(ПакетСсылка, ЗначенияПолей) Экспорт

	РегистрыСведений.СостояниеПакетовОбмена.ОбновитьСтатусПакета(ПакетСсылка, ЗначенияПолей);

КонецФункции // ()

Функция ПрочитатьПакетыИзКаталога(КаталогЗагрузки, ИмяПланаОбмена, УдалятьФайлы = Истина) Экспорт
	Результат	= МаркировкаКС.СтруктураРезультата();
	
	МаскаФайлов = СтрШаблон("Msg_*_%1_*.dd", Маркировка_ПИ.ЭтотУзел_Код(ИмяПланаОбмена));
	
	ОбработаноОбъектов = 0;
	
	Файлы = НайтиФайлы(КаталогЗагрузки, МаскаФайлов);
	Для Каждого Файл Из Файлы Цикл
		рЗагрузки = ПрочитатьПакет(Новый ДвоичныеДанные(Файл.ПолноеИмя));	
		Если рЗагрузки.Успешно Тогда                    
			Если УдалятьФайлы Тогда
				УдалитьФайлы(Файл.Путь, Файл.Имя);			
			КонецЕсли;
			ОбработаноОбъектов = ОбработаноОбъектов + 1;
			Результат.Сообщения.Добавить("Прочитан пакет: " + рЗагрузки.Данные);			
		Иначе        
			МаркировкаКС.ДобавитьОшибки(Результат, рЗагрузки);
			МаркировкаКС.ВывестиОшибки(рЗагрузки);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	Результат.Вставить("ОбработаноОбъектов", ОбработаноОбъектов);
	
	Возврат Результат;
КонецФункции //ПрочитатьПакетыИзКаталога(КаталогЗагрузки) Экспорт

Функция ЗаписатьПакетыВКаталог(Пакеты, КаталогВыгрузки) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	ОбработаноОбъектов = 0;
	
	Для Каждого Пакет Из Пакеты Цикл		          
		ИмяФайла = ИмяФайлаВыгрузки(Пакет);  
		ИмяФайла = МаркировкаС.ПолноеИмяФайла(КаталогВыгрузки, ИмяФайла);
		
		рВыгрузки = Справочники.ФР_ПакетыДанных.ВыгрузитьПакет(Пакет);			
		рВыгрузки.Данные.Записать(ИмяФайла);
		
		ЗаписатьВремяВыгрузки(Пакет);
		ОчиститьРегистрациюСостоянияПакета(Пакет);
		
		ОбработаноОбъектов = ОбработаноОбъектов + 1;
		Результат.Сообщения.Добавить("Сформирован файл: " + ИмяФайла);
	КонецЦикла;                                                               
	
	Результат.Вставить("ОбработаноОбъектов", ОбработаноОбъектов);
	
	Возврат Результат;
КонецФункции //ЗаписатьПакетыВКаталог(Пакеты, КаталогЗагрузки) Экспорт

Функция ОчиститьРегистрациюСостоянияПакета(Пакет)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Узел,	
	|	Пакет,
	|	КодУзла
	|ИЗ
	|	РегистрСведений.СостояниеПакетовОбмена.Изменения
	|ГДЕ
	|	Пакет = &Пакет
	|ИТОГИ ПО 
	|	Узел
	|";
	
	Запрос.УстановитьПараметр("Пакет", Пакет);
	
	Выборка_Узел = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Узел");
	Пока Выборка_Узел.Следующий() Цикл
		мНаборыЗаписей = Новый Массив;
		
		Выборка = Выборка_Узел.Выбрать();
		Пока Выборка.Следующий() Цикл
			НЗ = РегистрыСведений.СостояниеПакетовОбмена.СоздатьНаборЗаписей();
			
			НЗ.Отбор.Пакет.Установить(Выборка.Пакет);
			НЗ.Отбор.КодУзла.Установить(Выборка.КодУзла);
			
			мНаборыЗаписей.Добавить(НЗ);
		КонецЦикла;
		
		ПланыОбмена.УдалитьРегистрациюИзменений(Выборка_Узел.Узел, мНаборыЗаписей);
	КонецЦикла;
КонецФункции //ОчиститьРегистрациюСостоянияПакета(Пакет)

Функция ПакетыКВыгрузке(УзелПолучатель, Знач ИмяПланаОбмена = "ДанныеЧЗ") Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка
	|ИЗ                      
	|	Справочник.ФР_ПакетыДанных КАК Пакеты
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.СостояниеПакетовОбмена КАК СостояниеПакетов
	|ПО 
	|	СостояниеПакетов.Пакет = Пакеты.Ссылка
	|	И СостояниеПакетов.КодУзла = &КодТекущегоУзла
	|ГДЕ
	|	Пакеты.Отправитель	= &КодТекущегоУзла
	|	И Пакеты.Получатель = &КодУзлаПолучателя
	|	И Пакеты.ПланОбмена = &ИмяПланаОбмена
	|	И (СостояниеПакетов.ДатаОтправки ЕСТЬ NULL ИЛИ СостояниеПакетов.ДатаОтправки=ДАТАВРЕМЯ(1,1,1))
	|УПОРЯДОЧИТЬ ПО
	|	НомерСообщения
	|";
	
	МетаОбъект = Метаданные.НайтиПоТипу(ТипЗнч(УзелПолучатель));
	
	Если МетаОбъект <> Неопределено И Метаданные.ПланыОбмена.Содержит(МетаОбъект) Тогда
		КодУзлаПолучателя	= ПолучитьРеквизитШапки(УзелПолучатель, "Код");	
		ИмяПланаОбмена		= МетаОбъект.Имя;
	Иначе		
		КодУзлаПолучателя = УзелПолучатель;		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КодТекущегоУзла",	Маркировка_ПИ.ЭтотУзел_Код(ИмяПланаОбмена));
	Запрос.УстановитьПараметр("КодУзлаПолучателя",	КодУзлаПолучателя);
	Запрос.УстановитьПараметр("ИмяПланаОбмена",		ИмяПланаОбмена);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции //ПакетыКВыгрузке(УзелПолучатель, Знач ПланОбмена = "ДанныеЧЗ")

Функция ПакетыКЗагрузке(Знач ИмяПланаОбмена = "ДанныеЧЗ") Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка КАК Пакет
	|ИЗ                      
	|	Справочник.ФР_ПакетыДанных КАК Пакеты
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.СостояниеПакетовОбмена КАК СостояниеПакетов
	|ПО 
	|	СостояниеПакетов.Пакет = Пакеты.Ссылка
	|	И СостояниеПакетов.КодУзла = &КодТекущегоУзла
	|ГДЕ	
	|	Пакеты.Получатель 	= &КодТекущегоУзла
	|	И Пакеты.ПланОбмена = &ИмяПланаОбмена
	|	И НЕ Пакеты.ПометкаУдаления
	|	И (СостояниеПакетов.ДатаЗагрузки ЕСТЬ NULL ИЛИ СостояниеПакетов.ДатаЗагрузки=ДАТАВРЕМЯ(1,1,1))
	|УПОРЯДОЧИТЬ ПО
	|	НомерСообщения
	|";
	
	Запрос.УстановитьПараметр("КодТекущегоУзла",	Маркировка_ПИ.ЭтотУзел_Код(ИмяПланаОбмена));	
	Запрос.УстановитьПараметр("ИмяПланаОбмена",		ИмяПланаОбмена);
	
	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		Результат.Добавить(Выборка.Пакет);
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции //ПакетыКЗагрузке(УзелПолучатель, Знач ПланОбмена = "ДанныеЧЗ")

Функция ПакетыКЗагрузкеПоПорядку(Знач ИмяПланаОбмена = "ДанныеЧЗ") Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка КАК Пакет,
	|	ДатаПорядка	
	|ИЗ                      
	|	Справочник.ФР_ПакетыДанных КАК Пакеты
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.СостояниеПакетовОбмена КАК СостояниеПакетов
	|ПО 
	|	СостояниеПакетов.Пакет = Пакеты.Ссылка
	|	И СостояниеПакетов.КодУзла = &КодТекущегоУзла
	|ГДЕ	
	|	Пакеты.Получатель 	= &КодТекущегоУзла
	|	И Пакеты.ПланОбмена = &ИмяПланаОбмена
	|	И НЕ Пакеты.ПометкаУдаления
	|	И (СостояниеПакетов.ДатаЗагрузки ЕСТЬ NULL ИЛИ СостояниеПакетов.ДатаЗагрузки=ДАТАВРЕМЯ(1,1,1))
	|УПОРЯДОЧИТЬ ПО
	|	НомерСообщения
	|ИТОГИ ПО
	|	ДатаПорядка	
	|";
	
	Запрос.УстановитьПараметр("КодТекущегоУзла",	Маркировка_ПИ.ЭтотУзел_Код(ИмяПланаОбмена));	
	Запрос.УстановитьПараметр("ИмяПланаОбмена",		ИмяПланаОбмена);
	
	Результат = Новый Массив;
	Выборка_ДатаПорядка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДатаПорядка");
	Пока Выборка_ДатаПорядка.Следующий() Цикл
		Пакеты = Новый Массив;	
		Выборка = Выборка_ДатаПорядка.Выбрать();
		Пока Выборка.Следующий() Цикл		
			Пакеты.Добавить(Выборка.Пакет);
		КонецЦикла;	
		Результат.Добавить(Пакеты);
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции //ПакетыКЗагрузке(УзелПолучатель, Знач ПланОбмена = "ДанныеЧЗ")

Процедура ЗаписатьВремяВыгрузки(Пакет)
	ОбновитьСтатусПакета(Пакет, Новый Структура("ДатаОтправки", ТекущаяДата()));
КонецПроцедуры
